Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་སྐུ་ཚེའི་ཚད་ཕུན་སུམ་ཚོགས་པ་ལ་ནི་མངོན་པར་དགའ་ནས།
en: I rejoiced in the perfect lifespan of a buddha.

source: རྡོ་རྗེ་ལྟར་རི་དང་མཚོན་ཅ་ཐམས་ཅད་ཀྱི་མཐུས་ཐུབ་པར་དཀའ་བའི་སེམས་ཉོན་མོངས་པ་ཐམས་ཅད་དང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་ཕྱེད་མི་ཚུགས་པ་བསྐྱེད་དེ།
en: I had developed the motivation that could not be impaired by all the kleśas or by the śrāvakas and pratyeka­buddhas, which like a vajra could not be defeated even by the strength of all mountains and weapons.

source: རིགས་ཀྱི་བུ་དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སེམས་བསྐྱེད་པ་དེའི་མཐུས་བསྐལ་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་ཡིད་ཀྱི་དགུ་ལས་ཀྱང་འདོད་པ་ལ་སྤྱད་པར་ཡང་མི་དྲན་ན། གཉིས་ཀྱིས་གཉིས་འདུ་བ་ལྟ་ཅི་སྨོས།
en: “Noble one, from that time until now, through the power of having developed that motivation, throughout as many kalpas as there are atoms in Jambudvīpa, I do not remember ever in my mind enjoying pleasures, let alone copulation.

source: རིགས་ཀྱི་བུ་དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་རང་གི་གཉེན་བཤེས་ལའང་ཁོང་ཁྲོ་བའི་སེམས་ཅིག་མ་བསྐྱེད་ན། དེ་མ་ཡིན་པའི་སེམས་ཅན་མ་ཉེས་པའི་གཞན་ལྟ་ཅི་སྨོས།
en: “Noble one, from that time until now, I have never had one thought of anger toward a kalyāṇamitra, let alone offended any other being.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་བདག་ཏུ་ལྟ་བ་དང་། ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་ཡང་བསྐྱེད་པར་མི་དྲན་ན། དེ་མ་ཡིན་པའི་ཡོ་བྱད་གཞན་ལ་བདག་གིར་བྱས་ཏེ།
en: “Noble one, from that time until now, I do not remember having ever given rise to a single thought that holds the view that there is a self, let alone having attachment to things that I think of as being mine.

source: མངོན་པར་ཆགས་པ་ལྟ་ཅི་སྨོས། ཤི་འཕོ་བ་དང་མངལ་ན་གནས་པའི་ཚེའང་སེམས་རྨོངས་པའམ། འདུ་ཤེས་སྣ་ཚོགས་སམ། ལུང་དུ་མ་བསྟན་པའི་སེམས་ཀྱང་བྱུང་དུ་མི་དྲན་ན། ལེགས་པར་བསམས་ཤིང་གནས་པ་ལྟ་ཅི་སྨོས།
en: “Even when I died and was reborn inside a womb, I do not remember being in a state of stupidity, having various concepts, or having a neutral state of mind, let alone having a state of mental fixation.

source: བསྐལ་པ་དེ་སྙེད་ཅིག་ཏུ་སངས་རྒྱས་གཅིག་ཀྱང་ཆུང་ངུ་ན་རྨི་ལམ་དུ་མཐོང་བའི་རྣམ་པར་དམིགས་པར་ཡང་བརྗོད་དུ་མི་དྲན་ན། བྱང་ཆུབ་སེམས་དཔའི་མིག་བཅུས་མཐོང་བར་གྱུར་པ་ལྟ་ཅི་སྨོས།
en: “Throughout those kalpas I do not remember ever forgetting seeing a buddha, even down to the perception of the sight of a buddha in a dream, let alone the perception of the visual images of the ten levels of bodhisattvas.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་ཡང་དག་པར་འཛིན་ཀྱང་ཆུང་ངུ་ན་མྱིང་དུ་བྱ་བའི་ཆོས་ཀྱི་ཚིག་དང་། ཡི་གེ་གཅིག་ཀྱང་བརྗོད་པར་མི་དྲན་ན། དེ་བཞིན་གཤེགས་པའི་ཞལ་གྱི་མཛོད་ནས་བྱུང་བ་ལྟ་ཅི་སྨོས།
en: “From that time until now, while holding the clouds of Dharma of all the tathāgatas, I do not remember forgetting in my mind even a single word or term of the Dharma, even down to a single syllable, let alone what has emerged from the treasure of the mouths of the tathāgatas.

source: དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་ཆོས་ཀྱི་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་འཐུང་འཐུང་ཡང་། ཆུང་ངུ་ན་འཇིག་རྟེན་པའི་ཆོས་རྣམས་ལ། ཚིག་འགའ་འང་མ་བསམས་མ་བརྟགས་པར་མི་དྲན་ནོ།
en: “From that time until now, while I drank and drank from the ocean of the Dharma, I do not remember ever ignoring and not contemplating even any words of the worldly Dharmas.

source: །དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་དེ་སྙེད་ཅིག་གི་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལས་ཀྱང་། ཆུང་ངུ་ན་འཇིག་རྟེན་པའི་བཟོའི་རྒྱུས་དང་། ཚུལ་ཡང་རུང་སྟེ། ཆོས་ཀྱི་ཚུལ་གྱི་སྒོ་གང་ལ་ཡང་ཁོ་མོས་ཏིང་ངེ་འཛིན་མངོན་པར་མ་བསྒྲུབས་པ་དེ་ལྟ་བུ་མེད་དོ།
en: “From that time until now, I do not remember not accomplishing the samādhi of a single gateway to the ways of the Dharma from among the ocean of the ways of the Dharma, even down to the ways of the knowledge of worldly crafts.

source: །དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་དེ་བཞིན་གཤེགས་པ་དེ་སྙེད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་བཟུང་ཡང་ཇི་ལྟར་ཡོངས་སུ་བཟུང་བ་ལས་སེམས་ཅན་འདུལ་བའི་དབང་དུ་བྱ་བ་མ་གཏོགས་པར་ཆུང་ངུ་ན་རྗེས་སུ་བརྒྱུད་པའི་རྒྱུས་ཙམ་གྱི་ཚིག་དང་། ཡི་གེ་འགའ་ཡང་བོར་བར་མི་དྲན་ནོ།
en: “From that time until now, while I held the wheels of Dharma of the tathāgatas in order to guide beings, I do not remember leaving out a single word or even a single syllable that was transmitted to me.

source: །དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སངས་རྒྱས་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་མཐོང་ཡང་ཆུག་ཆུང་ངུ་ན་སྤྲུལ་པའི་སངས་རྒྱས་ཀྱི་སྨོན་ལམ་གྱི་རྒྱུད་ཀྱང་རུང་སྟེ། སྨོན་ལམ་འགའ་ཡང་ཁོ་མོས་སེམས་ཅན་རྒྱ་མཚོ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར། མངོན་པར་མ་བསྒྲུབས་པ་མེད་དོ། །དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སངས་རྒྱས་རྒྱ་མཚོ་དེ་སྙེད་ཅིག་གི་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ལས།
en: “From that time until now, there is not a single prayer from the ocean of the visions of buddhas that I have not accomplished in order to purify the ocean of beings, even down to carrying out the prayer of a buddha who was an emanation.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་འགའ་ཙམ་ཡང་ཁོ་མོས་བདག་གི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་མངོན་པར་མ་བསྒྲུབས་པ་དེ་ལྟ་བུ་མི་དྲན་ནོ། །དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་སེམས་ཅན་གང་ཁོ་མོས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མ་བསྐུལ་བ་དེ་ལྟ་བུ་གཅིག་ཀྱང་མིག་ལམ་དུ་འོང་པར་མི་དྲན་ནོ།
en: “From that time until now, I do not remember not practicing any bodhisattva conduct from the ocean of the past bodhisattva conduct of the ocean of buddhas in order to purify my conduct.

source: །དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་མངོན་པར་བསྒྲུབས་སུ་མི་དྲན་ནོ།
en: “From that time until now, I do not remember creating a single motivation that was focused on being a śrāvaka or a pratyeka­buddha.

source: །རིགས་ཀྱི་བུ་དེ་ནས་ཉེ་བར་བཟུང་བ་ཚུན་ཆད་དུ་བསྐལ་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ལོན་ཡང་ཚིག་དང་། ཡི་གེ་འགའ་ལ་ཡང་ཐེ་ཚོམ་བསྐྱེད་པའམ། གཉིས་ཀྱིས་འདུ་ཤེས་སམ། རྣམ་པར་རྟོག་པའི་འདུ་ཤེས་སམ། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་སམ། རབ་ཀྱི་འདུ་ཤེས་སམ། བཟང་ངན་གྱི་འདུ་ཤེས་སམ། སྡུག་མི་སྡུག་གི་འདུ་ཤེས་བསྐྱེད་དུ་མ་དྲན་ནོ།
en: “Noble one, from that time until now, throughout as many kalpas as there are atoms in Jambudvīpa, I do not remember ever having given rise to doubts, dualistic identification, conceptualized identification, variegated identification, obdurate identification, identification as inferior, or identification as appropriate or inappropriate concerning any single word or syllable.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེ་ཕྱིན་ཅད་དུ་སངས་རྒྱས་བྱུང་བ་དང་མ་བྲལ་ལོ།
en: “Noble one, since that time, I have never been separated from the appearance of a buddha.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་མ་བྲལ་ལོ།
en: I have never been separated from the buddha bhagavats.

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་མ་བྲལ་ལོ།
en: I have never been separated from the bodhisattvas.

source: །ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་དང་མ་བྲལ་ལོ།
en: I have never been separated from the true kalyāṇamitras.

source: །སངས་རྒྱས་ཀྱི་སྨོན་ལམ་ཐོས་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from hearing the prayers of the buddhas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐོས་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from hearing of the conduct of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་ཐོས་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from hearing the way of the perfections of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་སའི་ཡེ་ཤེས་སྣང་བའི་ཚུལ་ཐོས་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from hearing the way of the light of the wisdom of the level of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་དང་ཏིང་ངེ་འཛིན་མི་ཟད་པའི་མཛོད་དང་། གཏེར་ཐོས་པ་ཐོབ་པ་དང་མ་བྲལ་ལོ་མཐའ་དང་དབུས་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དྲ་བ་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཚུལ་ཐོས་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from the attainment of hearing the inexhaustible treasures and treasuries of the retentions and samādhis of the bodhisattvas. I have never been separated from hearing of the comprehension of and entry into the centerless and endless network of world realms.

source: །མཐའ་དང་དབུས་མེད་པའི་སེམས་ཅན་གྱི་ཁམས་འབྱུང་བའི་རྒྱུ་ཐོས་པ་ཐོབ་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from the attainment of hearing the causes for the arising of the centerless and endless realms of beings.

source: །འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་དྲ་བའི་དཀྱིལ་འཁོར་ཡོངས་སུ་ཟད་པར་བྱ་བའི་ཡེ་ཤེས་སྣང་བ་དང་མ་བྲལ་ལོ།
en: I have never been separated from the light of the wisdom of the cessation of the domain of the network of the kleśas of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་འབྱུང་བའི་རྒྱུའི་ཡེ་ཤེས་ཐོབ་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from the attainment of the wisdom of the causes that give rise to the roots of merit of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་ཡོངས་སུ་སྟོན་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from the manifestation of bodies in accordance with the aspirations of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤེས་པར་བྱེད་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ་དང་མ་བྲལ་ལོ།
en: I have never been separated from the pure domain of the speech that brings knowledge to all beings.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བའི་སྒོ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་འདི་དང་། ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་འདི་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: “Noble one, I have accomplished this gateway of the bodhisattva liberation called the essence of the wisdom that is difficult to attain and the gateway of the samādhi called the display of the tireless search for the Dharma

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་ཡི་དམ་ལ་བརྟན་པ་འདི་རྣམ་པར་ཕྱེ་བ་དང་། གཟུངས་ཀྱི་སྒོ་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱིས་འདི་དང་། སྤོབས་པའི་ཡེ་ཤེས་སྣང་བའི་སྒོ་ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བར་བརྗོད་པ་འདི་རྣམ་པར་ཕྱེ་བ་དང་། ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོད་ན་རིགས་ཀྱི་བུ་ཁྱོད་མངོན་སུམ་དུ་བལྟ་བར་འདོད་དམ།
en: I have reflected on the gateway to bodhisattva conduct with a firm commitment; I have contemplated the gateway called the power of retention of the level of the equality of all phenomena and the gateway called the light of the wisdom of eloquence that elucidates the basis of all phenomena ; and therefore miraculous powers have arisen. Noble one, do you wish to see them?”

source: སྨྲས་པ། འཕགས་མ་འཚལ་ལོ།
en: Sudhana answered, “I wish to do so.”

source: དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བ་དེ་ན་དེ་ལྟར་འདུག་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་སྒོ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་ལ་སྩོགས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་ལ་སྩོགས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དོན་ཡོད་པའི་དཀྱིལ་འཁོར་གྱི་རྒྱན་ལ་སྩོགས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྟོབས་བཅུའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་མངོན་དུ་འགྱུར་བ་ལ་སྩོགས་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་སྒོ་སངས་རྒྱས་ཀྱི་རིགས་མི་ཟད་པའི་མཛོད་ལ་སྩོགས་པ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ལ་རྣམ་པར་བལྟ་བ་དང་། རྣམ་པར་དཔྱད་པ་དང་། རྗེས་སུ་འཇུག་པ་དང་། ངེས་པར་རྟོགས་པར་བྱས་སོ།
en: The upāsikā Acalā viewed, analyzed, followed, and realized gateways of bodhisattva liberations such as the essence of wisdom that is difficult to attain and many millions of gateways of samādhis: gateways of samādhis such as the display of the tireless search for the Dharma , samādhis such as the display of the unfailing domain , samādhis such as facing the display of the domain of the wisdom of the ten strengths , and samādhis such as the inexhaustible treasure of the buddha family

source: །དེ་ལྟར་དགེ་བསྙེན་མ་མི་གཡོ་བ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཕྱོགས་བཅུར་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པ་དྲུག་དུ་གཡོས་པ་དང་། བཻ་ཌཱུརྱ་ཡོངས་སུ་དག་པའི་རྒྱུ་ལས་གྱུར་པར་གནས་པར་མཐོང་ངོ་།
en: As soon as the upāsikā Acalā rested in those samādhis, Sudhana, the head merchant’s son, saw world realms as numerous as the atoms in ten anabhilāpya buddha realms in the ten directions shake in six ways, and he saw that they were formed of pure beryl.

source: །འཇིག་རྟེན་གྱི་ཁམས་རེ་རེའི་གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་བརྒྱན། དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཕྲག་བརྒྱ་བརྒྱ་བཞུགས་པར་མཐོང་སྟེ།
en: He saw in each world realm a billion tathāgatas in a billion four-continent world realms.

source: ལ་ལ་ནི་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པ་ནས། ལ་ལ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་མཛད་པའི་བར་དུ་འང་མཐོང་ངོ་།
en: He saw some dwelling in Tuṣita and so on, up to some passing away into nirvāṇa.

source: །དེ་ཡང་འཇིག་རྟེན་གྱི་ཁམས་བཻ་ཌཱུརྱའི་རང་བཞིན་དེ་དག་ཡོངས་སུ་དག་ཅིང་སྒྲིབ་པ་མེད་པའི་ཕྱིར་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་སོ་སོ་ནས་འོད་ཟེར་དང་། འོད་ཀྱི་དཀྱིལ་འཁོར་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྒྱས་པར་ཁྱབ་པ་མངའ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་སོ་སོའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་རྒྱ་མཚོ་ཡང་མཐོང་བར་གྱུར་ཏོ།
en: He saw that because those completely pure world realms of beryl were unobscured, each of those tathāgatas pervaded the entire realm of phenomena with their light rays and halos; each of those tathāgatas had their own ocean of separate assemblies of followers;

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་རེ་རེའི་གསུང་གི་དཀྱིལ་འཁོར་ཆོས་ཀྱི་འཁོར་ལོ་ཐམས་ཅད་བརྗོད་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྣ་ལམ་དུ་རྣམ་པར་གྲགས་པའང་ཐོས་པར་གྱུར་ཏོ།
en: and each of those tathāgatas taught the wheel of the entire Dharma, which was heard by all beings, who listened to the domains of their speech.

source: །དེ་ནས་དགེ་བསྙེན་མ་མི་གཡོ་བ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་མཐོང་ངམ།
en: Then the upāsikā Acalā rose from that samādhi and said to Sudhana, the head merchant’s son, “Noble one, did you see that?

source: ཐོས་སམ་ཤེས་སམ།
en: Did you hear that? Did you discern that?”

source: སྨྲས་པ་འཕགས་མ་མཐོང་ངོ་།
en: He answered “I saw it. I heard it. I discerned it.”

source: །ཐོས་སོ་རིག་གོ །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡི་དམ་བརྟན་པ་ལ་སློབ་ཅིང་།
en: The upāsikā Acalā said, “Noble one, I have trained in the gateway of the bodhisattva conduct called possessing a strong commitment

source: ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བའི་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་སྟེ།
en: I have rested in the samādhi called the display of the tireless search for the Dharma

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་སྒོ་ཐུབ་པར་དཀའ་བའི་ཡེ་ཤེས་ཀྱི་སྙིང་པ་ལ་གནས་ནས།
en: I have dwelled in the gateway of bodhisattva liberations called the essence of the wisdom that is difficult to attain

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་སའི་གཟུངས་ཁོང་དུ་ཆུད་པ་དང་། སྤོབས་པའི་ཡེ་ཤེས་སྣང་བ་ཆོས་ཀྱི་གཞི་ཐམས་ཅད་སྣང་བ་བརྗོད་པ་ལ་མཁས་པའི་ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པར་ཟད་ན་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་ཚད་མེད་བསམ་གྱིས་མྱི་ཁྱབ་པ་དང་ལྡན་པ་ནམ་མཁའི་དབྱིངས་ལ་འདབ་ཆགས་ཁྱུ་མཆོག་འཁོད་པ་ལྟར་གནས་མེད་པར་སྤྱོད་པ།
en: I have realized the power of retention of the level of the equality of all phenomena ; and through being skilled in describing the light of the wisdom of eloquence that elucidates the basis of all phenomena , I have taught beings and brought them satisfaction. “However, how could I know the conduct or describe the qualities of the bodhisattvas who possess measureless, inconceivable qualities; whose activity has no fixed location, like the lord of birds in the sky;

source: ནམ་མཁའ་ལྡིང་གི་དབང་པོ་ཆེན་པོ་ལྟར་ཡོངས་སུ་སྨིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གདོན་པའི་ཕྱིར།
en: who, like the great lord of the garuḍas, dive into the ocean of beings in order to extract the ripened bodhisattvas;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱ་མཚོ་ལ་འཇུག་པ་ཚོང་པ་ལྟར་སྟོབས་བཅུའི་ཡེ་ཤེས་རིན་པོ་ཆེ་མངོན་པར་འདོད་ཅིང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིན་པོ་ཆེའི་གླིང་དུ་རྒྱུ་བ།
en: who, like merchants, go the island of the jewels of omniscience, longing for the jewel that is the wisdom of the ten strengths;

source: མཐུ་དང་ལྡན་པའི་ཉ་བ་ལྟར། ཡིད་དུ་འོང་བའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱ་དང་ལྡན་པའི་ལག་པས་སྲེད་པའི་ཆུ་ལས་བྱུང་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མངོན་པར་གདོན་པའི་ཕྱིར། ཆོས་ཀྱི་རྒྱ་མཚོ་ལ་རྣམ་པར་རྒྱུ་བ།
en: who, like strong fishermen, go onto the ocean of saṃsāra with the beautiful net of the domain of the wheel of the Dharma in their hands in order to draw ripened beings out from the water of craving;

source: ལྷའི་དབང་པོ་ལྟར་ཉོན་མོངས་པའི་ལྷ་མ་ཡིན་གྱི་གཡུལ་ཆེན་པོ་རྟུལ་བ་བཟློག་པའི་ཕྱིར། ཁམས་གསུམ་གྱི་གནས་ཡོངས་སུ་བཀང་ཞིང་རྣམ་པར་རྒྱུ་བ་ཉི་མའི་དཀྱིལ་འཁོར་ལྟར་སེམས་ཅན་གྱི་སྲེད་པའི་ཆུ་དང་། ཉོན་མོངས་པའི་འདམ་ཤིན་ཏུ་བསྐམ་པའི་ཕྱིར།
en: who, like the lord of the devas, move throughout the three realms, filling them in order to repel and subjugate the attacks of the asuras of the kleśas; who, like the disk of the sun, rise high in the sky of the realm of the Dharma in order to dry the water of the craving of beings and the mud of the kleśas;

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ནམ་མཁའི་དབྱིངས་ལ་ཡང་དག་པར་འཕགས་པ་ཟླ་བ་ཉ་ཞིང་རྒྱས་པ་ལྟར་འདུལ་བའི་ཡིད་ཀྱི་མེ་ཏོག་ཀུ་མུ་ཏ་རྣམ་པར་ཁ་དབྱེ་བའི་ཕྱིར། ཡེ་ཤེས་ཀྱི་ནམ་མཁའ་ལ་མངོན་པར་ཤར་བ།
en: who, like the full moon, shine in the sky of wisdom in order to cause the night lotuses of the minds of those to be guided to blossom;

source: སའི་གཞི་ལྟར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་དབང་པོའི་མྱུ་གུ་བསྐྱེད་ཅིང་། རྣམ་པར་སྤེལ་བའི་ཕྱིར་བྱམས་མི་བྱམས་དང་། མཐོན་དམན་མེད་པར་འཇིག་རྟེན་ན་མཉམ་པར་གནས་པ་རླུང་མར་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དང་། ལྟ་བའི་ཤིང་དང་ཤིང་ཕྲན་གྱི་ནགས་ཚལ་དང་། ཀུན་དགའ་རྩ་བ་ནས་གདོན་པའི་ཕྱིར་ཆགས་པ་མེད་པར་ཕྱོགས་ཐམས་ཅད་ཏུ་རྣམ་པར་རྒྱུ་བ།
en: who, like the surface of the Earth, support all equally without any distinction between those who are friends and not friends, or those who are high and those who are low, in order to cause the sprouts of the power of goodness in all beings to rise and grow; who, like a tempest, move everywhere without impediment in order to uproot the trees, vines, forests, and groves of the kleśas and false views of all beings;

source: འཁོར་ལོས་སྒྱུར་བ་ལྟར་བསྡུ་བའི་དངོས་པོའི་ཡོ་བྱད་དང་། རྐྱེན་གྱིས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཕྱིར། འཇིག་རྟེན་ན་རྣམ་པར་སྤྱོད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: who, like a cakravartin, act within the world in order to gather all beings through conditions and requisites as methods of gathering pupils?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཡུལ་དགའ་འཛིན་ཚད་མེད་པ་ན། གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, in a land called Amitatosala, there is a town named Tosala.

source: དེ་ན་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: There dwells the parivrājaka by the name of Sarvagamin.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་བསྙེན་མ་མི་གཡོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏོ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: །དགེ་བསྙེན་མ་མི་གཡོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་བསྙེན་མ་མི་གཡོ་བའི་དྲུང་ནས་སོང་ངོ་། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བསྙེན་མ་མི་གཡོ་བ་མངོན་དུ་བྱས་ཏེ། དགེ་བསྙེན་མ་མི་གཡོ་བའི་གདམས་ངག་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the upāsikā Acalā, circumambulated the upāsikā Acalā a hundred thousand times, keeping her to his right, and, looking back again and again, departed from the presence of the upāsikā Acalā.

source: དགེ་བསྙེན་མ་མི་གཡོ་བས་བསྟན་པ་དང་། ཡང་དག་པར་བསྟན་པ་དང་། བསྒྲགས་པ་དང་། བཤད་པ་དང་། བརྗོད་པ་དང་། ཡང་དག་པར་བརྗོད་པ་དང་། གཞག་པ་དང་། རྣམ་པར་ཕྱེ་བ་དང་། སྨོས་པ་དང་། རྒྱ་ཆེར་བསྟན་པ་དེ་དག་ཐམས་ཅད་ལ་གདོན་མི་ཟ་བར་ཡིད་ཆེས་ཤིང་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། རྗེས་སུ་བསམ་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སྒོམ་པ་དང་། ཡོངས་སུ་བསྒོམ་པ་དང་། གཞན་དུ་མི་འགྱུར་བ་དང་། རྟོགས་པར་བྱ་བ་དང་། སྣང་བར་བྱ་བ་དང་། མཉམ་པར་བྱ་བ་མྱེད་ཅིང་།
en: Sarvagamin Then Sudhana, the head merchant’s son, visualizing in his mind the upāsikā Acalā, remembering the instruction of the upāsikā Acalā, with conviction in and no doubt about what the upāsikā Acalā had taught, proclaimed, instructed, described, sanctioned, established, explicated, stated, and elaborated upon it; he followed it, contemplated it, comprehended it, meditated on it, was absorbed in it, was fixed upon it, understood it, illuminated it, and became equal to it.

source: མཐར་གྱིས་གནས་ནས་གནས་དང་ཡུལ་ནས་ཡུལ་དུ་རྒྱུ་སྟེ། རྒྱུ་ཞིང་སོང་སོང་ནས་ཡུལ་དགའ་འཛིན་ཚད་མེད་པ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Eventually, traveling from district to district, going from land to land, Sudhana arrived at the land called Amitatosala.

source: གྲོང་ཁྱེར་དགའ་བ་འཛིན་པ་རྨེད་ཅིང་ཚོལ་ཚོལ་ཏེ། ཉི་མ་ནུབ་ཏུ་ཆབ་ཞིག་ན་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པར་ཕྱིན་ནས།
en: He searched for the town named Tosala, and at sunset he arrived at the town of Tosala.

source: གྲོང་ཁྱེར་དགའ་བ་འཛིན་པའི་ནང་དུ་སོང་སྟེ། གྲོང་ཁྱེར་གྱི་ལམ་གྱི་བཞི་མདོའི་དབུས་ཤིག་ཏུ་ཕྱིན་ནས་སྲང་གི་སྒོ་ནས།
en: He entered the town of Tosala and went to the crossroads in the center of the town.

source: སྲང་གི་སྒོ་དང་ལམ་གྱི་བཞི་མདོ་ནས་ལམ་གྱི་བཞི་མདོ་དང་། གྲོང་ཕྲག་ནས་གྲོང་ཕྲག་ཏུ་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ཚོལ་ཞིང་རྨེད་རྨེད་པ་དང་། མཚན་མོ་མི་ཉལ་ཙམ་ཞིག་ན་གྲོང་ཁྱེར་དགའ་བ་འཛིན་པའི་བྱང་ཕྱོགས་ལོགས་ན།
en: He wandered from one street to another, from one crossroads to another, from one lane to another, searching and inquiring. When it was night and people were asleep, he saw to the north of the town of Tosala a hill called Sulabha.

source: རི་ཤིན་ཏུ་མོད་པ་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེའི་རྩེ་མོ་རྩྭ་དང་གེལ་པ་དང་། སྨན་སྣ་ཚོགས་དགའ་དགའ་ལྟར་སྐྱེས་པས་བརྒྱན་པ་འོད་ཆེན་པོ་དང་ལྡན་པ་ལ་ཉི་མ་ཤར་བ་ལྟ་བུར་གནས་པ་མཐོང་ངོ་།
en: Its summit was adorned by a delightful variety of grasses, bushes, and herbs, and it shone as brightly as the sun.

source: །དེས་སྣང་བ་དེ་མཐོང་ནས་དགའ་བའི་ཤུགས་ཆེན་པོ་སྐྱེས་ཏེ་འདི་སྙམ་དུ་བསམས་སོ། །བདག་གི་དགེ་བའི་བཤེས་གཉེན་རིའི་རྩེ་མོ་འདི་ལ་གདོན་མི་ཟ་བར་མཐོང་བར་འགྱུར་བ་ལྟ་ཞིག་སྙམ་ནས། གྲོང་ཁྱེར་དེ་ནས་བྱུང་སྟེ། རི་ཤིན་དུ་མོད་པ་གང་ན་བ་དེར་ཕྱིན་པ་དང་། རི་ཤིན་ཏུ་མོད་པ་དེ་ལ་འཛེགས་ནས།
en: Seeing that light, he felt a powerful joy and thought, “I will without doubt see the kalyāṇamitra on the summit of that hill.” He came out of the town and went to Sulabha Hill, and he climbed up Sulabha Hill and arrived at the very bright summit of the hill.

source: རིའི་རྩེ་མོ་སྣང་བ་ཆེན་པོ་ཅན་གང་ན་བ་དེར་ཕྱིན་པ་དང་། རྒྱང་རིང་པོ་ཞིག་ནས་ཀུན་ཏུ་རྒྱུ་ཐམས་ཅད་དུ་འགྲོ་བ་ཚངས་པ་ཆེན་པོ་བས་ཀྱང་ལྷག་པའི་ཁ་དོག་དང་ལྡན་པ་དཔལ་གྱིས་ཤིན་ཏུ་འབར་བ་ཞིག་ཚངས་པ་སྟོང་ཕྲག་བཅུས་ཀུན་ནས་བསྐོར་ཏེ། འཆགས་ནས་འཆག་ཅིང་འདུག་པ་མཐོང་ནས།
en: He saw in the distance the parivrājaka Sarvagamin, who shone with splendor and whose appearance was superior even to that of Mahābrahmā, and ten thousand brahmins were walking in circumambulation around him.

source: དེའི་དྲུང་དུ་ཕྱིན་ཏེ། རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། དེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: Sudhana approached him, bowed his head to his feet, circumambulated him many hundreds of thousands of times, and sat down before him.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: With his hands placed together in homage, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: Explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ལེགས་སོ། །ལེགས་སོ་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་ཐམས་ཅད་དུ་འགྲོ་བ་སྟེ།
en: Sarvagamin said, “Noble one, it is excellent, excellent, that you have in that way set out upon the highest, complete enlightenment!

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པའོ།
en: “Noble one, I, Sarvagamin, remain within the all-pervading bodhisattva conduct.
